# ElectricalDemandFactorValue Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ElectricalDemandFactorValue Methods
ElectricalDemandFactorValue Class See Also
---
The ElectricalDemandFactorValue type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| SetMaxRangeToUnlimited | Sets the max range on the value to unlimited |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# See Also
ElectricalDemandFactorValue Class
Autodesk.Revit.DB.Electrical Namespace